---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementGeometryCalculator.Dispose
source: html/e3bcd4a6-0de4-84ff-2630-0ec9019f7cda.htm
---
# Autodesk.Revit.DB.SpatialElementGeometryCalculator.Dispose Method

Releases all resources used by the SpatialElementGeometryCalculator

## Syntax (C#)
```csharp
public void Dispose()
```